eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеУниверсальныйСклад/абс_ПоступлениеУниверсальныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПоступлениеУниверсальныйСклад</name>
  <registerRecords>AccountingRegister.ЗабалансовыйУчет</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоступления</name>
    <type>
      <types>EnumRef.АБС_ВидыПоступленияЗабаланс</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗабалансовыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверенность</name>
    <type>
      <types>DocumentRef.Доверенность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийУниверсальныхДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНазначения</name>
      <type>
        <types>CatalogRef.АБС_СчетНазначенияМатериалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНазначения</name>
      <type>
        <types>ChartOfAccountsRef.ЗабалансовыйУчет</types>
        <types>CatalogRef.АБС_СчетНазначенияОборудование</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНазначения</name>
      <type>
        <types>ChartOfAccountsRef.ЗабалансовыйУчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/ЗабалансовыйУчет/ЗабалансовыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЗабалансовыйУчет</name>
  <chartOfAccounts>ChartOfAccounts.ЗабалансовыйУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ЗабалансовыйУчет.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ЗабалансовыйУчет.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.ЗабалансовыйУчет.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийУниверсальныхДокументов/абс_ВидыОперацийУниверсальныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийУниверсальныхДокументов</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/АБС_СчетНазначенияМатериалы/АБС_СчетНазначенияМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АБС_СчетНазначенияМатериалы</name>
  <predefined>
    <items>
      <name>ЗабалансовыйУчет</name>
      <description>Забалансовый учет</description>
    </items>
  </predefined>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.ЗабалансовыйУчет</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/АБС_СчетНазначенияОборудование/АБС_СчетНазначенияОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АБС_СчетНазначенияОборудование</name>
  <predefined>
    <items>
      <name>ЗабалансовыйУчет</name>
      <description>Забалансовый учет</description>
    </items>
  </predefined>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.ЗабалансовыйУчет</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеУниверсальныйСклад/ObjectModule.bsl
//////////////////////////////
/////ПЕРЕМЕННЫЕ МОДУЛЯ
Перем СчетНазначения;


////материалы
Процедура ОбработкаПроведенияМ(Отказ, Режим)
	Если НЕ ЗначениеЗаполнено(Склад)Тогда
		Сообщить("Не выбран склад");
		Отказ = Истина;
		
	КонецЕсли; 
	Если ЗабалансовыйУчет Тогда
		СчетНазначения=Справочники.АБС_СчетНазначенияМатериалы.НайтиПоНаименованию("Забалансовый учет",Истина);	
		
		Если НЕ ЗначениеЗаполнено(СчетНазначения) Тогда
			Сообщить("Не найден счет назначения ""Забалансовый учет""");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	

	Для каждого ТекСтрока Из Материалы Цикл
	    Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указан материал.");
			Отказ = Истина;			
		КонецЕсли;
		Если ТекСтрока.Количество = 0 Тогда
		    Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество материала """ + ТекСтрока.Номенклатура + ".");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗабалансовыйУчет И НЕ ЗначениеЗаполнено(ТекСтрока.СчетНазначения)Тогда
			
			Сообщить("Строка "+ТекСтрока.НомерСтроки +"  не выбран счет назначения");
			Отказ = Истина;
			
		КонецЕсли;		
		
	КонецЦикла; 
		
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			// регистр ЗабалансовыйУчет 
			Движение = Движения.ЗабалансовыйУчет.Добавить();
			Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.МатериалыНаСкладе;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаМатериалы.Сумма,ТекСтрокаМатериалы.Сумма+ТекСтрокаМатериалы.СуммаНДС) ,ТекСтрокаМатериалы.Сумма);
			Движение.КоличествоДт = ТекСтрокаМатериалы.Количество;
			Движение.Содержание = "Поступили материалы";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаМатериалы.Номенклатура;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.АБС_СчетНазначенияМатериалы] = ?(ЗабалансовыйУчет,СчетНазначения,ТекСтрокаМатериалы.СчетНазначения);
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
			Движение.Регистратор = Ссылка;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура ПечатьМ(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Ссылка);
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено, Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект ), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФормМ() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////оборудование

Процедура ОбработкаПроведенияО(Отказ, Режим)
	Если НЕ ЗначениеЗаполнено(Склад)Тогда
		Сообщить("Не выбран склад");
		Отказ = Истина;
	КонецЕсли; 
	Если ЗабалансовыйУчет Тогда
		СчетНазначения=Справочники.АБС_СчетНазначенияОборудование.НайтиПоНаименованию("Забалансовый учет",Истина);	
		
		Если НЕ ЗначениеЗаполнено(СчетНазначения) Тогда
			Сообщить("Не найден счет назначения ""Забалансовый учет""");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	

	Для каждого ТекСтрока Из Оборудование Цикл
	    Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано оборудование.");
			Отказ = Истина;			
		КонецЕсли;
		Если ТекСтрока.Количество = 0 Тогда
		    Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество оборудования """ + ТекСтрока.Номенклатура + ".");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗабалансовыйУчет И НЕ ЗначениеЗаполнено(ТекСтрока.СчетНазначения)Тогда
			
			Сообщить("Строка "+ТекСтрока.НомерСтроки +"  не выбран счет назначения");
			Отказ = Истина;
			
		КонецЕсли;		
		
	КонецЦикла; 
		
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрокаОборудование Из Оборудование Цикл
			// регистр ЗабалансовыйУчет 
			Движение = Движения.ЗабалансовыйУчет.Добавить();
			Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.ОборудованиеНаСкладе;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаОборудование.Сумма,ТекСтрокаОборудование.Сумма+ТекСтрокаОборудование.СуммаНДС) ,ТекСтрокаОборудование.Сумма);
			Движение.КоличествоДт = ТекСтрокаОборудование.Количество;
			Движение.Содержание = "Поступило оборудование";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаОборудование.Номенклатура;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.АБС_СчетНазначенияОборудование] = ?(ЗабалансовыйУчет,СчетНазначения,ТекСтрокаОборудование.СчетНазначения);
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура ПечатьО(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	//Если ИмяМакета = "АБС_М4" Тогда
	//	Обработка = Обработки.ПечатьМ4.Создать();
	//	Обработка.СсылкаНаОбъект=ЭтотОбъект.Ссылка;
	//	ТабДокумент = Обработка.Печать();	
	//	//АБС-		
	//
	//Иначе
		Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Ссылка);
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено, Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект ), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФормО() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////товары
Процедура ОбработкаПроведенияТ(Отказ, Режим)
	
	Если НЕ ЗначениеЗаполнено(Склад)Тогда
		Сообщить("Не выбран склад");
		Отказ = Истина;
	КонецЕсли;
	
	Для каждого ТекСтрока Из Товары Цикл
	    Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано оборудование.");
			Отказ = Истина;			
		КонецЕсли;
		Если ТекСтрока.Количество = 0 Тогда
		    Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество оборудования """ + ТекСтрока.Номенклатура + ".");
			Отказ = Истина;
		КонецЕсли;
			КонецЦикла;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// регистр ЗабалансовыйУчет 
		Движение = Движения.ЗабалансовыйУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.НоменклатураНаСкладе;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаТовары.Сумма,ТекСтрокаТовары.Сумма+ТекСтрокаТовары.СуммаНДС) ,ТекСтрокаТовары.Сумма);
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.Содержание = "Поступили товары";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаТовары.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
	КонецЦикла;
	            
КонецПроцедуры

//АБС+

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура ПечатьТ(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	//Если ИмяМакета = "АБС_М4" Тогда
	//	Обработка = Обработки.ПечатьМ4.Создать();
	//	Обработка.СсылкаНаОбъект=ЭтотОбъект.Ссылка;
	//	ТабДокумент = Обработка.Печать();	
	//	//АБС-		
	//
	//Иначе
		Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Ссылка);
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АБС_ПоступлениеУниверсальныйСклад", ИмяМакета, 
										ПараметрКоманды, Неопределено, Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект ), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФормТ() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()
//АБС-


//временные обёртки процедур и функций
Процедура ОбработкаПроведения_НеРаботает(Отказ, Режим)
	Отказ = Ложь;
	Если ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Материалы Тогда
		ОбработкаПроведенияМ(Отказ, Режим)
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Оборудование Тогда 
		ОбработкаПроведенияО(Отказ, Режим)
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары Тогда 
		ОбработкаПроведенияТ(Отказ, Режим)
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ ЗначениеЗаполнено(Склад)Тогда
		Сообщить("Не выбран склад");
		Отказ = Истина;
		
	КонецЕсли; 
	Если ЗабалансовыйУчет И НЕ (ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары) Тогда
		СчетНазначения=Справочники.АБС_СчетНазначенияМатериалы.НайтиПоНаименованию("Забалансовый учет",Истина);	
		
		Если НЕ ЗначениеЗаполнено(СчетНазначения) Тогда
			Сообщить("Не найден счет назначения ""Забалансовый учет""");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Материалы Тогда
		Для каждого ТекСтрока Из Материалы Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указан материал.");
				Отказ = Истина;			
			КонецЕсли;
			Если ТекСтрока.Количество = 0 Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество материала """ + ТекСтрока.Номенклатура + ".");
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗабалансовыйУчет И НЕ ЗначениеЗаполнено(ТекСтрока.СчетНазначения)Тогда
				
				Сообщить("Строка "+ТекСтрока.НомерСтроки +"  не выбран счет назначения");
				Отказ = Истина;
				
			КонецЕсли;		
			
		КонецЦикла; 
		
		Если Не Отказ Тогда
			НаборЗаписей = РегистрыБухгалтерии.ЗабалансовыйУчет.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			//Заполнение движений
			Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
				// регистр ЗабалансовыйУчет
				
				Движение = НаборЗаписей.Добавить();
				Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.МатериалыНаСкладе;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаМатериалы.Сумма,ТекСтрокаМатериалы.Сумма+ТекСтрокаМатериалы.СуммаНДС) ,ТекСтрокаМатериалы.Сумма);
				Движение.КоличествоДт = ТекСтрокаМатериалы.Количество;
				Движение.Содержание = "Поступили материалы";
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаМатериалы.Номенклатура;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.АБС_СчетНазначенияМатериалы] = ?(ЗабалансовыйУчет,СчетНазначения,ТекСтрокаМатериалы.СчетНазначения);
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
			КонецЦикла;
			НаборЗаписей.Записать(); 
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Оборудование Тогда
		Для каждого ТекСтрока Из Оборудование Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано оборудование.");
				Отказ = Истина;			
			КонецЕсли;
			Если ТекСтрока.Количество = 0 Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество оборудования """ + ТекСтрока.Номенклатура + ".");
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗабалансовыйУчет И НЕ ЗначениеЗаполнено(ТекСтрока.СчетНазначения)Тогда
				
				Сообщить("Строка "+ТекСтрока.НомерСтроки +"  не выбран счет назначения");
				Отказ = Истина;
				
			КонецЕсли;		
			
		КонецЦикла; 
		
		Если Не Отказ Тогда
			НаборЗаписей = РегистрыБухгалтерии.ЗабалансовыйУчет.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			СчетНазначенияОборудования = Справочники.АБС_СчетНазначенияОборудование.НайтиПоНаименованию("Забалансовый учет",Истина);            
			Для Каждого ТекСтрокаОборудование Из Оборудование Цикл
				// регистр ЗабалансовыйУчет 
				Движение = НаборЗаписей.Добавить();
				Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.ОборудованиеНаСкладе;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаОборудование.Сумма,ТекСтрокаОборудование.Сумма+ТекСтрокаОборудование.СуммаНДС) ,ТекСтрокаОборудование.Сумма);
				Движение.КоличествоДт = ТекСтрокаОборудование.Количество;
				Движение.Содержание = "Поступило оборудование";
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаОборудование.Номенклатура;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.АБС_СчетНазначенияОборудование] = ?(ЗабалансовыйУчет,СчетНазначенияОборудования,ТекСтрокаОборудование.СчетНазначения);
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары Тогда
		Для каждого ТекСтрока Из Товары Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано оборудование.");
				Отказ = Истина;			
			КонецЕсли;
			Если ТекСтрока.Количество = 0 Тогда
				Сообщить("Строка " + ТекСтрока.НомерСтроки + ", не указано количество оборудования """ + ТекСтрока.Номенклатура + ".");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей = РегистрыБухгалтерии.ЗабалансовыйУчет.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			// регистр ЗабалансовыйУчет 
			Движение = НаборЗаписей.Добавить();
			Движение.СчетДт = ПланыСчетов.ЗабалансовыйУчет.НоменклатураНаСкладе;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сумма = ?(УчитыватьНДС,?(СуммаВключаетНДС,ТекСтрокаТовары.Сумма,ТекСтрокаТовары.Сумма+ТекСтрокаТовары.СуммаНДС) ,ТекСтрокаТовары.Сумма);
			Движение.КоличествоДт = ТекСтрокаТовары.Количество;
			Движение.Содержание = "Поступили товары";
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ТекСтрокаТовары.Номенклатура;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады] = Склад;
		КонецЦикла;
		НаборЗаписей.Записать();
	Иначе
		Сообщить("Неправильный ВидОперации.");
		Отказ = Истина;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	Если ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Материалы Тогда
		ПечатьМ(ИмяМакета, КоличествоЭкземпляров, НаПринтер)
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Оборудование Тогда 
		ПечатьО(ИмяМакета, КоличествоЭкземпляров, НаПринтер)
	ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары Тогда 
		ПечатьТ(ИмяМакета, КоличествоЭкземпляров, НаПринтер)
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("М4",              "М-4 (Приходный ордер)");
	
	Возврат СтруктураМакетов;

	//Если ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Материалы Тогда
	//	Возврат ПолучитьСтруктуруПечатныхФормМ();
	//ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Оборудование Тогда 
	//	Возврат ПолучитьСтруктуруПечатныхФормО();
	//ИначеЕсли ВидОперации = Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары Тогда 
	//	Возврат ПолучитьСтруктуруПечатныхФормТ();
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли;
КонецФункции

Процедура ОчиститьНенужныеТабличныеЧасти() Экспорт
	Если ВидОперации <> Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Материалы Тогда
		Материалы.Очистить();
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Оборудование Тогда
		Оборудование.Очистить();
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.абс_ВидыОперацийУниверсальныхДокументов.Товары Тогда
		Товары.Очистить();
	КонецЕсли;
	
КонецПроцедуры
////
